# File Open Practice

In [1]:
import os 
os.getcwd()

'/home/spa/miniconda3/envs/adp/lib/python3.7/site-packages/statml/data/two'

# 콤마와 줄바꿈으로 구성된 텍스트 자료

In [13]:
data = open('data/1_newline.txt','r',encoding='cp949')
line = data.read()

In [24]:
import pandas as pd
data_ = pd.read_csv('data/1_newline.txt',encoding='cp949',header=None)
columns = ['번호', '이름', '나이', '키']
data_.columns = columns

In [25]:
data_

   번호   이름  나이    키
0   1  김윤석  24  174
1   2  나문희  43  162
2   3  정준하  36  186
3   4  장동건  31  177
4   5  김혜수  27  169

In [16]:
line

'1,김윤석,24,174\n2,나문희,43,162\n3,정준하,36,186\n4,장동건,31,177\n5,김혜수,27,169'

In [17]:
line = line.split('\n')

In [18]:
line

['1,김윤석,24,174',
 '2,나문희,43,162',
 '3,정준하,36,186',
 '4,장동건,31,177',
 '5,김혜수,27,169']

In [19]:
row = []
for i in line:
    row.append(i.split(','))
print(row)

[['1', '김윤석', '24', '174'], ['2', '나문희', '43', '162'], ['3', '정준하', '36', '186'], ['4', '장동건', '31', '177'], ['5', '김혜수', '27', '169']]

In [20]:
import pandas as pd
col_nm = ['번호','이름','나이','키']
df = pd.DataFrame(row, columns = col_nm)

In [21]:
col_num = ['번호', '나이', '키']
for i in col_num:
    df[i] = df[i].astype('int')

In [22]:
df

   번호   이름  나이    키
0   1  김윤석  24  174
1   2  나문희  43  162
2   3  정준하  36  186
3   4  장동건  31  177
4   5  김혜수  27  169

In [23]:
df.dtypes

번호     int64
이름    object
나이     int64
키      int64
dtype: object

# 컬럼명이 있는 콤마와 줄바꿈으로 구성된 텍스트 자료

In [84]:
data2 = open('data/2_newline_with_label.txt','r',encoding='cp949')
line2 = data2.read()

In [30]:
data2_ = pd.read_csv('data/2_newline_with_label.txt',encoding='cp949')

In [31]:
data2_

   번호   이름  나이    키
0   1  김윤석  24  174
1   2  나문희  43  162
2   3  정준하  36  186
3   4  장동건  31  177
4   5  김혜수  27  169

In [85]:
line2 = line2.split('\n')

In [86]:
line2

['번호,이름,나이,키',
 '1,김윤석,24,174',
 '2,나문희,43,162',
 '3,정준하,36,186',
 '4,장동건,31,177',
 '5,김혜수,27,169']

In [87]:
col_nm = line2[0].split(',')
col_nm

['번호', '이름', '나이', '키']

In [88]:
line2 = line2[1:]

In [92]:
row = []
for i in line2:
    row.append(i.split(','))
row

[['1', '김윤석', '24', '174'],
 ['2', '나문희', '43', '162'],
 ['3', '정준하', '36', '186'],
 ['4', '장동건', '31', '177'],
 ['5', '김혜수', '27', '169']]

In [93]:
df = pd.DataFrame(row, columns = col_nm)

In [94]:
col_num = ['번호', '나이', '키']
for i in col_num:
    df[i] = df[i].astype('int')

In [95]:
df

   번호   이름  나이    키
0   1  김윤석  24  174
1   2  나문희  43  162
2   3  정준하  36  186
3   4  장동건  31  177
4   5  김혜수  27  169

In [96]:
df.dtypes

번호     int32
이름    object
나이     int32
키      int32
dtype: object

# tsv ; 탭으로 분리된 텍스트 자료

In [117]:
data3 = open('data/3_tsv.txt', 'r', encoding = 'cp949')
line3 = data3.read()

line3

'번호\t이름\t나이\t키\n1\t김윤석\t24\t174\n2\t나문희\t43\t162\n3\t정준하\t36\t186\n4\t장동건\t31\t177\n5\t김혜수\t27\t169'

In [35]:
data3_ = pd.read_csv('data/3_tsv.txt', sep='\t', encoding='cp949')
data3_

   번호   이름  나이    키
0   1  김윤석  24  174
1   2  나문희  43  162
2   3  정준하  36  186
3   4  장동건  31  177
4   5  김혜수  27  169

In [118]:
line3 = line3.split('\n')
line3

['번호\t이름\t나이\t키',
 '1\t김윤석\t24\t174',
 '2\t나문희\t43\t162',
 '3\t정준하\t36\t186',
 '4\t장동건\t31\t177',
 '5\t김혜수\t27\t169']

In [119]:
row = []
for i in line3:
    row.append(i.split('\t'))
print(row)

[['번호', '이름', '나이', '키'], ['1', '김윤석', '24', '174'], ['2', '나문희', '43', '162'], ['3', '정준하', '36', '186'], ['4', '장동건', '31', '177'], ['5', '김혜수', '27', '169']]

In [120]:
col_nm = row[0]
print(col_nm)

['번호', '이름', '나이', '키']

In [121]:
row = row[1:]
print(row)

[['1', '김윤석', '24', '174'], ['2', '나문희', '43', '162'], ['3', '정준하', '36', '186'], ['4', '장동건', '31', '177'], ['5', '김혜수', '27', '169']]

In [122]:
df = pd.DataFrame(row, columns = col_nm)

# 숫자형 자료는 변환
col_num = ['번호', '나이', '키']
for i in col_num:
    df[i] = df[i].astype('int')
df

  번호   이름  나이    키
0  1  김윤석  24  174
1  2  나문희  43  162
2  3  정준하  36  186
3  4  장동건  31  177
4  5  김혜수  27  169

# 이상한 구분자

In [42]:
data4 = open('data/4_wierd_separator.txt','r',encoding='cp949')
line4 = data4.read()
line4

'1,김윤석,24,174!@#2,나문희,43,162!@#3,정준하,36,186!@#4,장동건,31,177!@#5,김혜수,27,169'

In [43]:
line4 = line4.split('!@#')
line4

['1,김윤석,24,174',
 '2,나문희,43,162',
 '3,정준하,36,186',
 '4,장동건,31,177',
 '5,김혜수,27,169']

In [129]:
row = []
for i in line4:
    row.append(i.split(','))
row

[['1', '김윤석', '24', '174'],
 ['2', '나문희', '43', '162'],
 ['3', '정준하', '36', '186'],
 ['4', '장동건', '31', '177'],
 ['5', '김혜수', '27', '169']]

In [130]:
col_nm = ['번호','이름','나이','키']
df = pd.DataFrame(row, columns = col_nm)

# 숫자형 자료는 변환
col_num = ['번호', '나이', '키']
for i in col_num:
    df[i] = df[i].astype('int')

df

  번호   이름  나이    키
0  1  김윤석  24  174
1  2  나문희  43  162
2  3  정준하  36  186
3  4  장동건  31  177
4  5  김혜수  27  169

# 콤마로만 구분된 텍스트 자료

In [179]:
data5 = open('data/5_only_commas.txt', 'r', encoding='cp949')
line5 = data5.read()
line5

'1,김윤석,24,174,2,나문희,43,162,3,정준하,36,186,4,장동건,31,177,5,김혜수,27,169'

In [132]:
line5 = line5.split(',')
line5

['1',
 '김윤석',
 '24',
 '174',
 '2',
 '나문희',
 '43',
 '162',
 '3',
 '정준하',
 '36',
 '186',
 '4',
 '장동건',
 '31',
 '177',
 '5',
 '김혜수',
 '27',
 '169']

In [136]:
row = []
for i in range(0, len(line5), 4):
    row.append(line5[i : i+4])
row

[['1', '김윤석', '24', '174'],
 ['2', '나문희', '43', '162'],
 ['3', '정준하', '36', '186'],
 ['4', '장동건', '31', '177'],
 ['5', '김혜수', '27', '169']]

In [139]:
df = pd.DataFrame(row, columns=['번호','이름','나이','키'])

# 숫자형 자료는 변환
col_num = ['번호', '나이', '키']
for i in col_num:
    df[i] = df[i].astype('int')
    
df

   번호   이름  나이    키
0   1  김윤석  24  174
1   2  나문희  43  162
2   3  정준하  36  186
3   4  장동건  31  177
4   5  김혜수  27  169

# 15개 데이터 행열로 바꿔보기

In [152]:
data6 = open('data/6_15data.txt','r',encoding = 'cp949')
line6 = data6.read()
line6

'a,b,c,d,e,f,g,h,i,j,k,l,m,n,o'

In [153]:
line6 = line6.split(',')
line6

['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j', 'k', 'l', 'm', 'n', 'o']

In [154]:
# 3열로 만들기
row = []
for i in range(0, len(line6), 3):
    row.append(line6[i:i+3])
row

[['a', 'b', 'c'],
 ['d', 'e', 'f'],
 ['g', 'h', 'i'],
 ['j', 'k', 'l'],
 ['m', 'n', 'o']]

In [155]:
# 5열로 만들기
row = []
for i in range(0, len(line6), 5):
    row.append(line6[i:i+5])
row

[['a', 'b', 'c', 'd', 'e'],
 ['f', 'g', 'h', 'i', 'j'],
 ['k', 'l', 'm', 'n', 'o']]

# rb : 바이트단위로 읽는 것

In [203]:
data7 = open('data/7_zero.txt','rb')
line7 = data7.read()
line7[:100]

b'\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00'

In [188]:
word = '송수형'.encode('utf-8')
word

b'\xec\x86\xa1\xec\x88\x98\xed\x98\x95'

In [189]:
word.decode('utf-8')
# utf-8
# utf-16
# cp949

'송수형'

# rb : 바이트단위 w/ garbage

# csv파일을 open으로 불러오기

In [235]:
data9 = open('data/9_ade_sales.csv')
line9 = data9.read()
line9[:200]

'Date,Date_days,요일,주말y/n,Location,Lemon(판매잔 수),Lemon_Ratio,,Orange(판매잔 수),Orange_Ratio,,L+O(판매잔 수),정가판매량,Temperature,섭씨,Leaflets,Price,원가,정가,할인가,마진,매출이익\n7/1/2016,2016-07-01 Friday,금,0,Park,97,0.59,0.99'

In [236]:
line9 = line9.split('\n')
line9[:5]

['Date,Date_days,요일,주말y/n,Location,Lemon(판매잔 수),Lemon_Ratio,,Orange(판매잔 수),Orange_Ratio,,L+O(판매잔 수),정가판매량,Temperature,섭씨,Leaflets,Price,원가,정가,할인가,마진,매출이익',
 '7/1/2016,2016-07-01 Friday,금,0,Park,97,0.59,0.99,67,0.41,1.01,164,74,70,21.1,90,0.25,1450,5800,1450,0,559700',
 '7/2/2016,2016-07-02 Saturday,토,1,Park,98,0.59,1,67,0.41,1,165,75,72,22.2,90,0.25,1450,5800,1450,0,565500',
 '7/3/2016,2016-07-03 Sunday,일,1,Park,110,0.59,0.99,77,0.41,1.02,187,83,71,21.7,104,0.25,1450,5800,1450,0,632200',
 '7/4/2016,2016-07-04 Monday,월,0,Beach,134,0.58,0.97,99,0.42,1.05,233,135,76,24.4,98,0.25,1450,5800,1450,0,925100']

In [ ]:
row = []
for i in line9:
    row.append(i.split(','))
row

In [238]:
col_nm = row[0]
row = row[1:]
df = pd.DataFrame(row, columns = col_nm)
df.head()

,Date,Date_days,요일,주말y/n,Location,Lemon(판매잔 수),Lemon_Ratio,,Orange(판매잔 수),Orange_Ratio,...,정가판매량,Temperature,섭씨,Leaflets,Price,원가,정가,할인가,마진,매출이익
0,7/1/2016,2016-07-01 Friday,금,0,Park,97,0.59,0.99,67,0.41,...,74,70,21.1,90,0.25,1450,5800,1450,0,559700
1,7/2/2016,2016-07-02 Saturday,토,1,Park,98,0.59,1,67,0.41,...,75,72,22.2,90,0.25,1450,5800,1450,0,565500
2,7/3/2016,2016-07-03 Sunday,일,1,Park,110,0.59,0.99,77,0.41,...,83,71,21.7,104,0.25,1450,5800,1450,0,632200
3,7/4/2016,2016-07-04 Monday,월,0,Beach,134,0.58,0.97,99,0.42,...,135,76,24.4,98,0.25,1450,5800,1450,0,925100
4,7/5/2016,2016-07-05 Tuesday,화,0,Beach,159,0.57,0.96,118,0.43,...,142,78,25.6,135,0.25,1450,5800,1450,0,1019350